// pages/relevantTerms/terms.js
Page({

  /**
   * 页面的初始数据
   */
  data: {
    txt:`组织推荐板块将通过每周推荐一个组织的形式帮助大家推广，同时为了能有更多的组织得到该机会，我们将不会选取在一个学期内已推广过的组织。推荐渠道分别为新加入组织、综合评比、关注人数以及官方推荐，仅前两者需要申请。 

Q&A： 
Q：请问如何申请？ 
A：发送邮件至UlifeOfficial@163.com，邮件名请设置为“推荐申请-新加入组织/综合评比-组织名”。 

Q：我们想通过新加入组织、综合评比申请，请问需要提供什么？ 
A：在邮件中，请在正文部分填写组织的简介，字数不宜过长，并另起一行解释为什么您的组织值得被推荐。 

Q：请问如果有多个组织参与竞选，将如何选择哪？ 
A：我们将通过一套完善的评比机制进行选择，很抱歉由于一定原因具体机制暂时无法透露。但显然组织更多高质量的大型活动并将材料提供给我们将有助于您的组织更加出众。 

Q：新加入组织评比的限制条件是什么？ 
A：必须是在组织用户注册后的2个月之内哦。
    `
  },

  /**
   * 生命周期函数--监听页面加载
   */
  onLoad: function (options) {

  },

  /**
   * 生命周期函数--监听页面初次渲染完成
   */
  onReady: function () {

  },

  /**
   * 生命周期函数--监听页面显示
   */
  onShow: function () {

  },

  /**
   * 生命周期函数--监听页面隐藏
   */
  onHide: function () {

  },

  /**
   * 生命周期函数--监听页面卸载
   */
  onUnload: function () {

  },

  /**
   * 页面相关事件处理函数--监听用户下拉动作
   */
  onPullDownRefresh: function () {

  },

  /**
   * 页面上拉触底事件的处理函数
   */
  onReachBottom: function () {

  },

  /**
   * 用户点击右上角分享
   */
  onShareAppMessage: function () {

  }
})