//获取应用实例
const app = getApp()

Page({
  data: {
    navH: 0,
    newVersion: "合作任务\n\n阿塔尼斯\n\n“轨道轰炸”的能量消耗从50降低至25。\n“轨道轰炸”的冷却时间从60秒降低至30秒。\n'护盾超载'的冷却时间从300秒降低至180秒。\n龙骑士的伤害从14（对重甲22）提升至14（对重甲28）。从武器升级获得的伤害加成由+2改为+1（对重甲+3）。\n龙骑士的基础射程从5提升至6。“奇点充能”升级后的射程从7提升至8。\n凤凰的基础伤害从5（对轻甲10）提升至7（对轻甲12）。\n'灵能风暴'的升级花费从150/150降低至100/100。\n'心能水晶坠饰'升级的消耗从150/150降低至100/100。\n\n霍纳与汉\n霍纳的所有单位的“战术跳跃”技能现在都不再需要目标区域的视野。"
  },
  onLoad: function (options) {
    let _this = this;
    _this.setData({
      navH: app.globalData.navbarHeight
    })
  }
})

